//Цикл while

//Выведите в консоль числа от 1 до 100.
//01
let i = 1;

while ( i <= 100 ) {
    console.log(i);
    i++
}


//Выведите в консоль числа 11 до 33.
//02
let i = 11;

while ( i <= 33 ) {
    console.log(i);
    i++
}


//Более сложный цикл
//Выведите в консоль четные числа в промежутке от 0 до 100.
//03
let i = 2;

while ( i <= 100) {
    console.log(i);
    i += 2;
}


//Выведите в консоль нечетные числа в промежутке от 1 до 99.
//04
let i = 1;

while ( i <= 99) {
    console.log(i);
    i += 2;
}



//Обратный отсчет
//Счетчик не обязательно должен увеличиваться в цикле. Бывают и обратные ситуации, когда счетчик, наоборот, уменьшается.

//Выведите в консоль числа от 30 до 0.
//05
let i = 30;

while ( i >= 0) {
    console.log(i);
    i --;
}
