//Логические операции
//01
//Используя оператор ==, узнайте, равны ли значения этих переменных или нет.
let a = 2 * (3 - 1);
let b = 6 - 2;

let result = a == b;
console.log(result);//true


//02
//Используя оператор >, узнайте, больше ли переменная a, чем b.
let c = 5 * (7 - 4);
let d = 1 + 2 + 7;

let result1 = c > d;
console.log(result1);//true

//03
//Используя операцию оператор !=, узнайте, разные ли значения этих переменных или нет.
let x = 2 ** 4;
let y = 4 ** 2;

let result2 = x != y;
console.log(result2);//false
